In [1]:
import sqlite3
import pandas as pd

db = sqlite3.connect('school.sqlite')

In [2]:
data = pd.read_sql_query('select * from student', db)
data

   RollNumber     Name  Age
0         101     Aman   20
1         102     Amit   21
2         103    Mohit   24
3         104   Nikhil   34
4         105    nidhi   20
5         106  MAnisha   21
6         107   Ankush   22

In [4]:
data[data['Age'] == 20]

   RollNumber   Name  Age
0         101   Aman   20
4         105  nidhi   20

In [5]:
data = pd.DataFrame([[201, "aman", "english", 20000], [202, "komal", "maths", 22000], [203, "mahesh", "science", 23000]],
                    columns = ["ID", "name", "course", "salary"])
data

    ID    name   course  salary
0  201    aman  english   20000
1  202   komal    maths   22000
2  203  mahesh  science   23000

In [6]:
data.to_sql("Faculty", db)

3

In [9]:
from IPython.display import FileLink
FileLink('School.sqlite')

E:\Anaconda\Sqlite\School.sqlite

In [2]:
db = sqlite3.connect('IMDB.sqlite')

In [10]:
data = pd.read_sql_query('SELECT genre, COUNT(genre) AS genre_count FROM genre GROUP BY genre', db)
data

        genre  genre_count
0                       41
1      Action           33
2   Adventure           43
3   Animation           13
4   Biography           21
5      Comedy           31
6       Crime           11
7       Drama           77
8      Family            3
9     Fantasy            7
10    History            6
11     Horror            2
12      Music            3
13    Musical            1
14    Mystery            7
15    Romance           13
16     Sci-Fi           18
17      Sport            3
18   Thriller           14
19        War            2
20    Western            2

In [4]:
data = pd.read_sql_query('select title, rating, max(totalvotes) from IMDB ', db)
data

              Title  Rating  max(totalvotes)
0  Inception (2010)     8.8          1609713

In [10]:
data = pd.read_sql_query('select title, max(runtime) from IMDB ', db)
data

                             Title max(runtime)
0  The Grand Budapest Hotel (2014)       99 min